epfl-cs358/2025sp-turboslam/esp32/microros_rplidar_c1/src/sl_lidar_driver.cpp
/*
 * Slamtec LIDAR SDK
 *
 *  Copyright (c) 2014 - 2020 Shanghai Slamtec Co., Ltd.
 *  http://www.slamtec.com
 *
 */
/*
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include "sdkcommon.h"
#include "hal/abs_rxtx.h"
#include "hal/thread.h"
#include "hal/types.h"
#include "hal/assert.h"
#include "hal/locker.h"
#include "hal/socket.h"
#include "hal/event.h"

#ifdef ESP32
#include "../include/sl_lidar_driver.h"
#include "../include/sl_crc.h"
#else
#include "sl_lidar_driver.h"
#include "sl_crc.h"
#endif

#include <algorithm>

#ifdef _WIN32
#define NOMINMAX
#undef min
#undef max
#endif

#if defined(__cplusplus) && __cplusplus >= 201103L
#ifndef _GXX_NULLPTR_T
#define _GXX_NULLPTR_T
typedef decltype(nullptr) nullptr_t;
#endif
#endif /* C++11.  */

namespace sl
{
	static void printDeprecationWarn(const char *fn, const char *replacement)
	{
		fprintf(stderr, "*WARN* YOU ARE USING DEPRECATED API: %s, PLEASE MOVE TO %s\n", fn, replacement);
	}

	static void convert(const sl_lidar_response_measurement_node_t &from, sl_lidar_response_measurement_node_hq_t &to)
	{
		to.angle_z_q14 = (((from.angle_q6_checkbit) >> SL_LIDAR_RESP_MEASUREMENT_ANGLE_SHIFT) << 8) / 90; // transfer to q14 Z-angle
		to.dist_mm_q2 = from.distance_q2;
		to.flag = (from.sync_quality & SL_LIDAR_RESP_MEASUREMENT_SYNCBIT);																											// trasfer syncbit to HQ flag field
		to.quality = (from.sync_quality >> SL_LIDAR_RESP_MEASUREMENT_QUALITY_SHIFT) << SL_LIDAR_RESP_MEASUREMENT_QUALITY_SHIFT; // remove the last two bits and then make quality from 0-63 to 0-255
	}

	static void convert(const sl_lidar_response_measurement_node_hq_t &from, sl_lidar_response_measurement_node_t &to)
	{
		to.sync_quality = (from.flag & SL_LIDAR_RESP_MEASUREMENT_SYNCBIT) | ((from.quality >> SL_LIDAR_RESP_MEASUREMENT_QUALITY_SHIFT) << SL_LIDAR_RESP_MEASUREMENT_QUALITY_SHIFT);
		to.angle_q6_checkbit = 1 | (((from.angle_z_q14 * 90) >> 8) << SL_LIDAR_RESP_MEASUREMENT_ANGLE_SHIFT);
		to.distance_q2 = from.dist_mm_q2 > sl_u16(-1) ? sl_u16(0) : sl_u16(from.dist_mm_q2);
	}

	static sl_u32 _varbitscale_decode(sl_u32 scaled, sl_u32 &scaleLevel)
	{
		static const sl_u32 VBS_SCALED_BASE[] = {
				SL_LIDAR_VARBITSCALE_X16_DEST_VAL,
				SL_LIDAR_VARBITSCALE_X8_DEST_VAL,
				SL_LIDAR_VARBITSCALE_X4_DEST_VAL,
				SL_LIDAR_VARBITSCALE_X2_DEST_VAL,
				0,
		};

		static const sl_u32 VBS_SCALED_LVL[] = {
				4,
				3,
				2,
				1,
				0,
		};

		static const sl_u32 VBS_TARGET_BASE[] = {
				(0x1 << SL_LIDAR_VARBITSCALE_X16_SRC_BIT),
				(0x1 << SL_LIDAR_VARBITSCALE_X8_SRC_BIT),
				(0x1 << SL_LIDAR_VARBITSCALE_X4_SRC_BIT),
				(0x1 << SL_LIDAR_VARBITSCALE_X2_SRC_BIT),
				0,
		};

		for (size_t i = 0; i < _countof(VBS_SCALED_BASE); ++i)
		{
			int remain = ((int)scaled - (int)VBS_SCALED_BASE[i]);
			if (remain >= 0)
			{
				scaleLevel = VBS_SCALED_LVL[i];
				return VBS_TARGET_BASE[i] + (remain << scaleLevel);
			}
		}
		return 0;
	}

	static inline float getAngle(const sl_lidar_response_measurement_node_t &node)
	{
		return (node.angle_q6_checkbit >> SL_LIDAR_RESP_MEASUREMENT_ANGLE_SHIFT) / 64.f;
	}

	static inline void setAngle(sl_lidar_response_measurement_node_t &node, float v)
	{
		sl_u16 checkbit = node.angle_q6_checkbit & SL_LIDAR_RESP_MEASUREMENT_CHECKBIT;
		node.angle_q6_checkbit = (((sl_u16)(v * 64.0f)) << SL_LIDAR_RESP_MEASUREMENT_ANGLE_SHIFT) | checkbit;
	}

	static inline float getAngle(const sl_lidar_response_measurement_node_hq_t &node)
	{
		return node.angle_z_q14 * 90.f / 16384.f;
	}

	static inline void setAngle(sl_lidar_response_measurement_node_hq_t &node, float v)
	{
		node.angle_z_q14 = sl_u32(v * 16384.f / 90.f);
	}

	static inline sl_u16 getDistanceQ2(const sl_lidar_response_measurement_node_t &node)
	{
		return node.distance_q2;
	}

	static inline sl_u32 getDistanceQ2(const sl_lidar_response_measurement_node_hq_t &node)
	{
		return node.dist_mm_q2;
	}

	template <class TNode>
	static bool angleLessThan(const TNode &a, const TNode &b)
	{
		return getAngle(a) < getAngle(b);
	}

	template <class TNode>
	static sl_result ascendScanData_(TNode *nodebuffer, size_t count)
	{
		float inc_origin_angle = 360.f / count;
		size_t i = 0;

		// Tune head
		for (i = 0; i < count; i++)
		{
			if (getDistanceQ2(nodebuffer[i]) == 0)
			{
				continue;
			}
			else
			{
				while (i != 0)
				{
					i--;
					float expect_angle = getAngle(nodebuffer[i + 1]) - inc_origin_angle;
					if (expect_angle < 0.0f)
						expect_angle = 0.0f;
					setAngle(nodebuffer[i], expect_angle);
				}
				break;
			}
		}

		// all the data is invalid
		if (i == count)
			return SL_RESULT_OPERATION_FAIL;

		// Tune tail
		for (i = count - 1; i >= 0; i--)
		{
			if (getDistanceQ2(nodebuffer[i]) == 0)
			{
				continue;
			}
			else
			{
				while (i != (count - 1))
				{
					i++;
					float expect_angle = getAngle(nodebuffer[i - 1]) + inc_origin_angle;
					if (expect_angle > 360.0f)
						expect_angle -= 360.0f;
					setAngle(nodebuffer[i], expect_angle);
				}
				break;
			}
		}

		// Fill invalid angle in the scan
		float frontAngle = getAngle(nodebuffer[0]);
		for (i = 1; i < count; i++)
		{
			if (getDistanceQ2(nodebuffer[i]) == 0)
			{
				float expect_angle = frontAngle + i * inc_origin_angle;
				if (expect_angle > 360.0f)
					expect_angle -= 360.0f;
				setAngle(nodebuffer[i], expect_angle);
			}
		}

		// Reorder the scan according to the angle value
		std::sort(nodebuffer, nodebuffer + count, &angleLessThan<TNode>);

		return SL_RESULT_OK;
	}

	class SlamtecLidarDriver : public ILidarDriver
	{
	public:
		enum
		{
			LEGACY_SAMPLE_DURATION = 476,
		};

		enum
		{
			NORMAL_CAPSULE = 0,
			DENSE_CAPSULE = 1,
		};

		enum
		{
			A2A3_LIDAR_MINUM_MAJOR_ID = 2,
			TOF_LIDAR_MINUM_MAJOR_ID = 6,
		};

