epfl-cs358/2025sp-turboslam/esp32/microros_rplidar_c1/src/sl_lidar_driver.cpp
	public:
		SlamtecLidarDriver()
				: _channel(NULL), _isConnected(false), _isScanning(false), _isSupportingMotorCtrl(MotorCtrlSupportNone), _cached_sampleduration_std(LEGACY_SAMPLE_DURATION), _cached_sampleduration_express(LEGACY_SAMPLE_DURATION), _cached_scan_node_hq_count(0), _cached_scan_node_hq_count_for_interval_retrieve(0)
		{
		}

		sl_result connect(IChannel *channel)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;

			if (!channel)
				return SL_RESULT_OPERATION_FAIL;
			if (isConnected())
				return SL_RESULT_ALREADY_DONE;
			_channel = channel;

			{
				rp::hal::AutoLocker l(_lock);
				ans = _channel->open();
				if (!ans)
					return SL_RESULT_OPERATION_FAIL;

				_channel->flush();
			}

			_isConnected = true;

			ans = checkMotorCtrlSupport(_isSupportingMotorCtrl, 500);
			return SL_RESULT_OK;
		}

		void disconnect()
		{
			if (_isConnected)
				_channel->close();
		}

		bool isConnected()
		{
			return _isConnected;
		}

		sl_result reset(sl_u32 timeoutInMs = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			{
				rp::hal::AutoLocker l(_lock);
				ans = _sendCommand(SL_LIDAR_CMD_RESET);
				if (!ans)
				{
					return ans;
				}
			}
			return SL_RESULT_OK;
		}

		sl_result getAllSupportedScanModes(std::vector<LidarScanMode> &outModes, sl_u32 timeoutInMs = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			bool confProtocolSupported = false;
			ans = checkSupportConfigCommands(confProtocolSupported);
			if (!ans)
				return SL_RESULT_INVALID_DATA;

			if (confProtocolSupported)
			{
				// 1. get scan mode count
				sl_u16 modeCount;
				ans = getScanModeCount(modeCount);
				if (!ans)
					return ans;
				// 2. for loop to get all fields of each scan mode
				for (sl_u16 i = 0; i < modeCount; i++)
				{
					LidarScanMode scanModeInfoTmp;
					memset(&scanModeInfoTmp, 0, sizeof(scanModeInfoTmp));
					scanModeInfoTmp.id = i;
					ans = getLidarSampleDuration(scanModeInfoTmp.us_per_sample, i);
					if (!ans)
						return ans;
					ans = getMaxDistance(scanModeInfoTmp.max_distance, i);
					if (!ans)
						return ans;
					ans = getScanModeAnsType(scanModeInfoTmp.ans_type, i);
					if (!ans)
						return ans;
					ans = getScanModeName(scanModeInfoTmp.scan_mode, i);
					if (!ans)
						return ans;
					outModes.push_back(scanModeInfoTmp);
				}
				return ans;
			}

			return ans;
		}

		sl_result getTypicalScanMode(sl_u16 &outMode, sl_u32 timeoutInMs = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			std::vector<sl_u8> answer;
			bool lidarSupportConfigCmds = false;
			ans = checkSupportConfigCommands(lidarSupportConfigCmds);
			if (!ans)
				return ans;

			if (lidarSupportConfigCmds)
			{
				ans = getLidarConf(SL_LIDAR_CONF_SCAN_MODE_TYPICAL, answer, std::vector<sl_u8>(), timeoutInMs);
				if (!ans)
					return ans;
				if (answer.size() < sizeof(sl_u16))
				{
					return SL_RESULT_INVALID_DATA;
				}
				const sl_u16 *p_answer = reinterpret_cast<const sl_u16 *>(&answer[0]);
				outMode = *p_answer;
				return ans;
			}
			// old version of triangle lidar
			else
			{
				outMode = SL_LIDAR_CONF_SCAN_COMMAND_EXPRESS;
				return ans;
			}
			return ans;
		}

		sl_result startScan(bool force, bool useTypicalScan, sl_u32 options = 0, LidarScanMode *outUsedScanMode = nullptr)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			bool ifSupportLidarConf = false;
			startMotor();
			ans = checkSupportConfigCommands(ifSupportLidarConf);
			if (!ans)
				return ans;
			if (useTypicalScan)
			{
				sl_u16 typicalMode;
				ans = getTypicalScanMode(typicalMode);
				if (!ans)
					return ans;

				// call startScanExpress to do the job
				return startScanExpress(false, typicalMode, 0, outUsedScanMode);
			}

			// 'useTypicalScan' is false, just use normal scan mode
			if (ifSupportLidarConf)
			{
				if (outUsedScanMode)
				{
					outUsedScanMode->id = SL_LIDAR_CONF_SCAN_COMMAND_STD;
					ans = getLidarSampleDuration(outUsedScanMode->us_per_sample, outUsedScanMode->id);
					if (!ans)
						return ans;
					ans = getMaxDistance(outUsedScanMode->max_distance, outUsedScanMode->id);
					if (!ans)
						return ans;
					ans = getScanModeAnsType(outUsedScanMode->ans_type, outUsedScanMode->id);
					if (!ans)
						return ans;
					ans = getScanModeName(outUsedScanMode->scan_mode, outUsedScanMode->id);
					if (!ans)
						return ans;
				}
			}

			return startScanNormal(force);
		}

		sl_result startScanNormal(bool force, sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			if (!isConnected())
				return SL_RESULT_OPERATION_FAIL;
			if (_isScanning)
				return SL_RESULT_ALREADY_DONE;

			stop(); // force the previous operation to stop
			setMotorSpeed();
			{
				rp::hal::AutoLocker l(_lock);
				ans = _sendCommand(force ? SL_LIDAR_CMD_FORCE_SCAN : SL_LIDAR_CMD_SCAN);
				if (!ans)
					return ans;
				// waiting for confirmation
				sl_lidar_ans_header_t response_header;
				ans = _waitResponseHeader(&response_header, timeout);
				if (!ans)
					return ans;

				// verify whether we got a correct header
				if (response_header.type != SL_LIDAR_ANS_TYPE_MEASUREMENT)
				{
					return SL_RESULT_INVALID_DATA;
				}

				sl_u32 header_size = (response_header.size_q30_subtype & SL_LIDAR_ANS_HEADER_SIZE_MASK);
				if (header_size < sizeof(sl_lidar_response_measurement_node_t))
				{
					return SL_RESULT_INVALID_DATA;
				}
				_isScanning = true;
				_cachethread = CLASS_THREAD(SlamtecLidarDriver, _cacheScanData);
				if (_cachethread.getHandle() == 0)
				{
					return SL_RESULT_OPERATION_FAIL;
				}
			}
			return SL_RESULT_OK;
		}

		sl_result startScanExpress(bool force, sl_u16 scanMode, sl_u32 options = 0, LidarScanMode *outUsedScanMode = nullptr, sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			if (!isConnected())
				return SL_RESULT_OPERATION_FAIL;
			if (_isScanning)
				return SL_RESULT_ALREADY_DONE;
			stop(); // force the previous operation to stop

			bool ifSupportLidarConf = false;
			ans = checkSupportConfigCommands(ifSupportLidarConf);
			if (!ans)
				return SL_RESULT_INVALID_DATA;

			if (outUsedScanMode)
			{
				outUsedScanMode->id = scanMode;
				if (ifSupportLidarConf)
				{
					ans = getLidarSampleDuration(outUsedScanMode->us_per_sample, outUsedScanMode->id);
					if (!ans)
						return SL_RESULT_INVALID_DATA;

					ans = getMaxDistance(outUsedScanMode->max_distance, outUsedScanMode->id);
					if (!ans)
						return SL_RESULT_INVALID_DATA;

					ans = getScanModeAnsType(outUsedScanMode->ans_type, outUsedScanMode->id);
					if (!ans)
						return SL_RESULT_INVALID_DATA;

