epfl-cs358/2025sp-turboslam/esp32/microros_rplidar_c1/src/sl_lidar_driver.cpp
					ans = getScanModeName(outUsedScanMode->scan_mode, outUsedScanMode->id);
					if (!ans)
						return SL_RESULT_INVALID_DATA;
				}
			}

			// get scan answer type to specify how to wait data
			sl_u8 scanAnsType;
			if (ifSupportLidarConf)
			{
				getScanModeAnsType(scanAnsType, scanMode);
			}
			else
			{
				scanAnsType = SL_LIDAR_ANS_TYPE_MEASUREMENT_CAPSULED;
			}

			if (!ifSupportLidarConf || scanAnsType == SL_LIDAR_ANS_TYPE_MEASUREMENT)
			{
				if (scanMode == SL_LIDAR_CONF_SCAN_COMMAND_STD)
				{
					return startScan(force, false, 0, outUsedScanMode);
				}
			}
			{
				rp::hal::AutoLocker l(_lock);

				startMotor();
				sl_lidar_payload_express_scan_t scanReq;
				memset(&scanReq, 0, sizeof(scanReq));
				if (!ifSupportLidarConf)
				{
					if (scanMode != SL_LIDAR_CONF_SCAN_COMMAND_STD && scanMode != SL_LIDAR_CONF_SCAN_COMMAND_EXPRESS)
						scanReq.working_mode = sl_u8(scanMode);
				}
				else
					scanReq.working_mode = sl_u8(scanMode);

				scanReq.working_flags = options;
				delay(5);
				ans = _sendCommand(SL_LIDAR_CMD_EXPRESS_SCAN, &scanReq, sizeof(scanReq));
				if (!ans)
				{
					ans = _sendCommand(SL_LIDAR_CMD_EXPRESS_SCAN, &scanReq, sizeof(scanReq));
					if (!ans)
						return SL_RESULT_INVALID_DATA;
				}

				// waiting for confirmation
				sl_lidar_ans_header_t response_header;
				ans = _waitResponseHeader(&response_header, timeout);
				if (!ans)
					return ans;

				// verify whether we got a correct header
				if (response_header.type != scanAnsType)
				{
					return SL_RESULT_INVALID_DATA;
				}

				sl_u32 header_size = (response_header.size_q30_subtype & SL_LIDAR_ANS_HEADER_SIZE_MASK);

				if (scanAnsType == SL_LIDAR_ANS_TYPE_MEASUREMENT_CAPSULED)
				{
					if (header_size < sizeof(sl_lidar_response_capsule_measurement_nodes_t))
					{
						return SL_RESULT_INVALID_DATA;
					}
					_cached_capsule_flag = NORMAL_CAPSULE;
					_isScanning = true;
					_cachethread = CLASS_THREAD(SlamtecLidarDriver, _cacheCapsuledScanData);
				}
				else if (scanAnsType == SL_LIDAR_ANS_TYPE_MEASUREMENT_DENSE_CAPSULED)
				{
					if (header_size < sizeof(sl_lidar_response_capsule_measurement_nodes_t))
					{
						return SL_RESULT_INVALID_DATA;
					}
					_cached_capsule_flag = DENSE_CAPSULE;
					_isScanning = true;
					_cachethread = CLASS_THREAD(SlamtecLidarDriver, _cacheCapsuledScanData);
				}
				else if (scanAnsType == SL_LIDAR_ANS_TYPE_MEASUREMENT_HQ)
				{
					if (header_size < sizeof(sl_lidar_response_hq_capsule_measurement_nodes_t))
					{
						return SL_RESULT_INVALID_DATA;
					}
					_isScanning = true;
					_cachethread = CLASS_THREAD(SlamtecLidarDriver, _cacheHqScanData);
				}
				else
				{
					if (header_size < sizeof(sl_lidar_response_ultra_capsule_measurement_nodes_t))
					{
						return SL_RESULT_INVALID_DATA;
					}
					_isScanning = true;
					_cachethread = CLASS_THREAD(SlamtecLidarDriver, _cacheUltraCapsuledScanData);
				}

				if (_cachethread.getHandle() == 0)
				{
					return SL_RESULT_OPERATION_FAIL;
				}
			}
			return SL_RESULT_OK;
		}

		sl_result stop(sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			_disableDataGrabbing();

			{
				rp::hal::AutoLocker l(_lock);
				ans = _sendCommand(SL_LIDAR_CMD_STOP);
				if (!ans)
					return ans;
			}
			delay(100);

			if (_isSupportingMotorCtrl == MotorCtrlSupportPwm)
				setMotorSpeed(0);

			return SL_RESULT_OK;
		}

		sl_result grabScanDataHq(sl_lidar_response_measurement_node_hq_t *nodebuffer, size_t &count, sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			switch (_dataEvt.wait(timeout))
			{
			case rp::hal::Event::EVENT_TIMEOUT:
				count = 0;
				return SL_RESULT_OPERATION_TIMEOUT;
			case rp::hal::Event::EVENT_OK:
			{
				if (_cached_scan_node_hq_count == 0)
					return SL_RESULT_OPERATION_TIMEOUT; // consider as timeout

				rp::hal::AutoLocker l(_lock);

				size_t size_to_copy = std::min(count, _cached_scan_node_hq_count);
				memcpy(nodebuffer, _cached_scan_node_hq_buf, size_to_copy * sizeof(sl_lidar_response_measurement_node_hq_t));

				count = size_to_copy;
				_cached_scan_node_hq_count = 0;
			}
				return SL_RESULT_OK;

			default:
				count = 0;
				return SL_RESULT_OPERATION_FAIL;
			}
		}

		sl_result getDeviceInfo(sl_lidar_response_device_info_t &info, sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			_disableDataGrabbing();
			delay(20);
			{
				rp::hal::AutoLocker l(_lock);
				ans = _sendCommand(SL_LIDAR_CMD_GET_DEVICE_INFO);
				if (!ans)
					return ans;
				return _waitResponse(info, SL_LIDAR_ANS_TYPE_DEVINFO);
			}
		}

		sl_result checkMotorCtrlSupport(MotorCtrlSupport &support, sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			support = MotorCtrlSupportNone;
			_disableDataGrabbing();
			{
				sl_lidar_response_device_info_t devInfo;
				ans = getDeviceInfo(devInfo, 500);
				if (!ans)
					return ans;
				sl_u8 majorId = devInfo.model >> 4;
				if (majorId >= TOF_LIDAR_MINUM_MAJOR_ID)
				{
					support = MotorCtrlSupportRpm;
					return ans;
				}
				else if (majorId >= A2A3_LIDAR_MINUM_MAJOR_ID)
				{

					rp::hal::AutoLocker l(_lock);
					sl_lidar_payload_acc_board_flag_t flag;
					flag.reserved = 0;
					ans = _sendCommand(SL_LIDAR_CMD_GET_ACC_BOARD_FLAG, &flag, sizeof(flag));
					if (!ans)
						return ans;

					sl_lidar_response_acc_board_flag_t acc_board_flag;
					ans = _waitResponse(acc_board_flag, SL_LIDAR_ANS_TYPE_ACC_BOARD_FLAG);
					if (acc_board_flag.support_flag & SL_LIDAR_RESP_ACC_BOARD_FLAG_MOTOR_CTRL_SUPPORT_MASK)
					{
						support = MotorCtrlSupportPwm;
					}
					return ans;
				}
			}
			return SL_RESULT_OK;
		}

		sl_result getFrequency(const LidarScanMode &scanMode, const sl_lidar_response_measurement_node_hq_t *nodes, size_t count, float &frequency)
		{
			float sample_duration = scanMode.us_per_sample;
			frequency = 1000000.0f / (count * sample_duration);
			return SL_RESULT_OK;
		}

		sl_result setLidarIpConf(const sl_lidar_ip_conf_t &conf, sl_u32 timeout)
		{
			sl_result ans = setLidarConf(SL_LIDAR_CONF_LIDAR_STATIC_IP_ADDR, &conf, sizeof(sl_lidar_ip_conf_t), timeout);
			return ans;
		}

		sl_result getHealth(sl_lidar_response_device_health_t &health, sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;

			if (!isConnected())
				return SL_RESULT_OPERATION_FAIL;

			_disableDataGrabbing();

			{
				rp::hal::AutoLocker l(_lock);
				ans = _sendCommand(SL_LIDAR_CMD_GET_DEVICE_HEALTH);
				if (!ans)
					return ans;
				delay(50);
				ans = _waitResponse(health, SL_LIDAR_ANS_TYPE_DEVHEALTH);
			}
			return ans;
		}

		sl_result getDeviceMacAddr(sl_u8 *macAddrArray, sl_u32 timeoutInMs)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;

