epfl-cs358/2025sp-turboslam/esp32/microros_rplidar_c1/src/sl_lidar_driver.cpp
			std::vector<sl_u8> answer;
			ans = getLidarConf(SL_LIDAR_CONF_LIDAR_MAC_ADDR, answer, std::vector<sl_u8>(), timeoutInMs);
			if (!ans)
				return ans;

			int len = answer.size();
			if (0 == len)
				return SL_RESULT_INVALID_DATA;
			memcpy(macAddrArray, &answer[0], len);
			return ans;
		}

		sl_result ascendScanData(sl_lidar_response_measurement_node_hq_t *nodebuffer, size_t count)
		{
			return ascendScanData_<sl_lidar_response_measurement_node_hq_t>(nodebuffer, count);
		}

		sl_result getScanDataWithIntervalHq(sl_lidar_response_measurement_node_hq_t *nodebuffer, size_t &count)
		{
			size_t size_to_copy = 0;
			{
				rp::hal::AutoLocker l(_lock);
				if (_cached_scan_node_hq_count_for_interval_retrieve == 0)
				{
					return SL_RESULT_OPERATION_TIMEOUT;
				}
				// copy all the nodes(_cached_scan_node_count_for_interval_retrieve nodes) in _cached_scan_node_buf_for_interval_retrieve
				size_to_copy = _cached_scan_node_hq_count_for_interval_retrieve;
				memcpy(nodebuffer, _cached_scan_node_hq_buf_for_interval_retrieve, size_to_copy * sizeof(sl_lidar_response_measurement_node_hq_t));
				_cached_scan_node_hq_count_for_interval_retrieve = 0;
			}
			count = size_to_copy;

			return SL_RESULT_OK;
		}
		sl_result setMotorSpeed(sl_u16 speed = DEFAULT_MOTOR_SPEED)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;

			if (speed == DEFAULT_MOTOR_SPEED)
			{
				sl_lidar_response_desired_rot_speed_t desired_speed;
				ans = getDesiredSpeed(desired_speed);
				if (!ans)
					return ans;
				if (_isSupportingMotorCtrl == MotorCtrlSupportPwm)
					speed = desired_speed.pwm_ref;
				else
					speed = desired_speed.rpm;
			}
			switch (_isSupportingMotorCtrl)
			{
			case MotorCtrlSupportNone:
				break;
			case MotorCtrlSupportPwm:
				sl_lidar_payload_motor_pwm_t motor_pwm;
				motor_pwm.pwm_value = speed;
				ans = _sendCommand(SL_LIDAR_CMD_SET_MOTOR_PWM, (const sl_u8 *)&motor_pwm, sizeof(motor_pwm));
				if (!ans)
					return ans;
				break;
			case MotorCtrlSupportRpm:
				sl_lidar_payload_motor_pwm_t motor_rpm;
				motor_rpm.pwm_value = speed;
				ans = _sendCommand(SL_LIDAR_CMD_HQ_MOTOR_SPEED_CTRL, (const sl_u8 *)&motor_rpm, sizeof(motor_rpm));
				if (!ans)
					return ans;
				break;
			}
			return SL_RESULT_OK;
		}

		sl_result getMotorInfo(LidarMotorInfo &motorInfo, sl_u32 timeoutInMs)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			rp::hal::AutoLocker l(_lock);
			{
				std::vector<sl_u8> answer;

				ans = getLidarConf(RPLIDAR_CONF_MIN_ROT_FREQ, answer, std::vector<sl_u8>());
				if (!ans)
					return ans;

				const sl_u16 *min_answer = reinterpret_cast<const sl_u16 *>(&answer[0]);
				motorInfo.min_speed = *min_answer;

				ans = getLidarConf(RPLIDAR_CONF_MAX_ROT_FREQ, answer, std::vector<sl_u8>());
				if (!ans)
					return ans;

				const sl_u16 *max_answer = reinterpret_cast<const sl_u16 *>(&answer[0]);
				motorInfo.max_speed = *max_answer;

				sl_lidar_response_desired_rot_speed_t desired_speed;
				ans = getDesiredSpeed(desired_speed);
				if (!ans)
					return ans;
				if (motorInfo.motorCtrlSupport == MotorCtrlSupportPwm)
					motorInfo.desired_speed = desired_speed.pwm_ref;
				else
					motorInfo.desired_speed = desired_speed.rpm;
			}
			return SL_RESULT_OK;
		}

	protected:
		sl_result startMotor()
		{
			return setMotorSpeed(600);
		}

		sl_result getDesiredSpeed(sl_lidar_response_desired_rot_speed_t &motorSpeed, sl_u32 timeoutInMs = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			std::vector<sl_u8> answer;
			ans = getLidarConf(SL_LIDAR_CONF_DESIRED_ROT_FREQ, answer, std::vector<sl_u8>(), timeoutInMs);

			if (!ans)
				return ans;

			const sl_lidar_response_desired_rot_speed_t *p_answer = reinterpret_cast<const sl_lidar_response_desired_rot_speed_t *>(&answer[0]);
			motorSpeed = *p_answer;
			return SL_RESULT_OK;
		}

		sl_result checkSupportConfigCommands(bool &outSupport, sl_u32 timeoutInMs = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			sl_lidar_response_device_info_t devinfo;
			ans = getDeviceInfo(devinfo, timeoutInMs);
			if (!ans)
				return ans;

			sl_u16 modecount;
			ans = getScanModeCount(modecount, 250);
			if ((sl_result)ans == SL_RESULT_OK)
				outSupport = true;

			return SL_RESULT_OK;
		}

		sl_result getScanModeCount(sl_u16 &modeCount, sl_u32 timeoutInMs = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			std::vector<sl_u8> answer;
			ans = getLidarConf(SL_LIDAR_CONF_SCAN_MODE_COUNT, answer, std::vector<sl_u8>(), timeoutInMs);

			if (!ans)
				return ans;

			const sl_u16 *p_answer = reinterpret_cast<const sl_u16 *>(&answer[0]);
			modeCount = *p_answer;
			return SL_RESULT_OK;
		}

		sl_result setLidarConf(sl_u32 type, const void *payload, size_t payloadSize, sl_u32 timeout)
		{
			if (type < 0x00010000 || type > 0x0001FFFF)
				return SL_RESULT_INVALID_DATA;
			std::vector<sl_u8> requestPkt;
			requestPkt.resize(sizeof(sl_lidar_payload_set_scan_conf_t) + payloadSize);
			if (!payload)
				payloadSize = 0;
			sl_lidar_payload_set_scan_conf_t *query = reinterpret_cast<sl_lidar_payload_set_scan_conf_t *>(&requestPkt[0]);

			query->type = type;

			if (payloadSize)
				memcpy(&query[1], payload, payloadSize);

			sl_result ans;
			{
				rp::hal::AutoLocker l(_lock);
				if (IS_FAIL(ans = _sendCommand(SL_LIDAR_CMD_SET_LIDAR_CONF, &requestPkt[0], requestPkt.size())))
				{ //
					return ans;
				}
				delay(20);
				// waiting for confirmation
				sl_lidar_ans_header_t response_header;
				if (IS_FAIL(ans = _waitResponseHeader(&response_header, timeout)))
				{
					return ans;
				}
				// verify whether we got a correct header
				if (response_header.type != SL_LIDAR_ANS_TYPE_SET_LIDAR_CONF)
				{
					return SL_RESULT_INVALID_DATA;
				}
				sl_u32 header_size = (response_header.size_q30_subtype & SL_LIDAR_ANS_HEADER_SIZE_MASK);
				if (header_size < sizeof(type))
				{
					return SL_RESULT_INVALID_DATA;
				}
				if (!_channel->waitForData(header_size, timeout))
				{
					return SL_RESULT_OPERATION_TIMEOUT;
				}
				delay(100);
				struct _sl_lidar_response_set_lidar_conf
				{
					sl_u32 type;
					sl_u32 result;
				} answer;

				_channel->read(reinterpret_cast<sl_u8 *>(&answer), header_size);
				return answer.result;
			}
		}

		sl_result getLidarConf(sl_u32 type, std::vector<sl_u8> &outputBuf, const std::vector<sl_u8> &reserve = std::vector<sl_u8>(), sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			sl_lidar_payload_get_scan_conf_t query;
			query.type = type;
			int sizeVec = reserve.size();

			int maxLen = sizeof(query.reserved) / sizeof(query.reserved[0]);
			if (sizeVec > maxLen)
				sizeVec = maxLen;

