epfl-cs358/2025sp-turboslam/esp32/microros_rplidar_c1/src/sl_lidar_driver.cpp
			if (sizeVec > 0)
				memcpy(query.reserved, &reserve[0], reserve.size());

			Result<nullptr_t> ans = SL_RESULT_OK;
			{
				rp::hal::AutoLocker l(_lock);
				ans = _sendCommand(SL_LIDAR_CMD_GET_LIDAR_CONF, &query, sizeof(query));
				if (!ans)
					return ans;
				// delay(50);
				//  waiting for confirmation
				sl_lidar_ans_header_t response_header;
				ans = _waitResponseHeader(&response_header, timeout);
				if (!ans)
					return ans;

				// verify whether we got a correct header
				if (response_header.type != SL_LIDAR_ANS_TYPE_GET_LIDAR_CONF)
				{
					return SL_RESULT_INVALID_DATA;
				}

				sl_u32 header_size = (response_header.size_q30_subtype & SL_LIDAR_ANS_HEADER_SIZE_MASK);
				if (header_size < sizeof(type))
				{
					return SL_RESULT_INVALID_DATA;
				}
				// delay(100);
				if (!_channel->waitForData(header_size, timeout))
				{
					return SL_RESULT_OPERATION_TIMEOUT;
				}

				std::vector<sl_u8> dataBuf;
				dataBuf.resize(header_size);
				_channel->read(reinterpret_cast<sl_u8 *>(&dataBuf[0]), header_size);

				// check if returned type is same as asked type
				sl_u32 replyType = -1;
				memcpy(&replyType, &dataBuf[0], sizeof(type));
				if (replyType != type)
				{
					return SL_RESULT_INVALID_DATA;
				}

				// copy all the payload into &outputBuf
				int payLoadLen = header_size - sizeof(type);

				// do consistency check
				if (payLoadLen <= 0)
				{
					return SL_RESULT_INVALID_DATA;
				}
				// copy all payLoadLen bytes to outputBuf
				outputBuf.resize(payLoadLen);
				memcpy(&outputBuf[0], &dataBuf[0] + sizeof(type), payLoadLen);
			}

			return SL_RESULT_OK;
		}

		sl_result getLidarSampleDuration(float &sampleDurationRes, sl_u16 scanModeID, sl_u32 timeoutInMs = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			std::vector<sl_u8> reserve(2);
			memcpy(&reserve[0], &scanModeID, sizeof(scanModeID));

			std::vector<sl_u8> answer;
			ans = getLidarConf(SL_LIDAR_CONF_SCAN_MODE_US_PER_SAMPLE, answer, reserve, timeoutInMs);

			if (!ans)
				return ans;

			if (answer.size() < sizeof(sl_u32))
			{
				return SL_RESULT_INVALID_DATA;
			}
			const sl_u32 *result = reinterpret_cast<const sl_u32 *>(&answer[0]);
			sampleDurationRes = (float)(*result >> 8);
			return ans;
		}

		sl_result getMaxDistance(float &maxDistance, sl_u16 scanModeID, sl_u32 timeoutInMs = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			std::vector<sl_u8> reserve(2);
			memcpy(&reserve[0], &scanModeID, sizeof(scanModeID));

			std::vector<sl_u8> answer;
			ans = getLidarConf(SL_LIDAR_CONF_SCAN_MODE_MAX_DISTANCE, answer, reserve, timeoutInMs);
			if (!ans)
				return ans;

			if (answer.size() < sizeof(sl_u32))
			{
				return SL_RESULT_INVALID_DATA;
			}
			const sl_u32 *result = reinterpret_cast<const sl_u32 *>(&answer[0]);
			maxDistance = (float)(*result >> 8);
			return ans;
		}

		sl_result getScanModeAnsType(sl_u8 &ansType, sl_u16 scanModeID, sl_u32 timeoutInMs = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			std::vector<sl_u8> reserve(2);
			memcpy(&reserve[0], &scanModeID, sizeof(scanModeID));

			std::vector<sl_u8> answer;
			ans = getLidarConf(SL_LIDAR_CONF_SCAN_MODE_ANS_TYPE, answer, reserve, timeoutInMs);
			if (!ans)
				return ans;

			if (answer.size() < sizeof(sl_u8))
			{
				return SL_RESULT_INVALID_DATA;
			}
			const sl_u8 *result = reinterpret_cast<const _u8 *>(&answer[0]);
			ansType = *result;
			return ans;
		}

		sl_result getScanModeName(char *modeName, sl_u16 scanModeID, sl_u32 timeoutInMs = DEFAULT_TIMEOUT)
		{
			Result<nullptr_t> ans = SL_RESULT_OK;
			std::vector<sl_u8> reserve(2);
			memcpy(&reserve[0], &scanModeID, sizeof(scanModeID));

			std::vector<sl_u8> answer;
			ans = getLidarConf(SL_LIDAR_CONF_SCAN_MODE_NAME, answer, reserve, timeoutInMs);
			if (!ans)
				return ans;
			int len = answer.size();
			if (0 == len)
				return SL_RESULT_INVALID_DATA;
			memcpy(modeName, &answer[0], len);
			return ans;
		}

		sl_result negotiateSerialBaudRate(sl_u32 requiredBaudRate, sl_u32 *baudRateDetected)
		{
			// ask the LIDAR to stop working first...
			stop();
			_channel->flush();

			// wait for a while
			delay(10);
			_channel->clearReadCache();

			// sending magic byte to let the target LIDAR start baudrate measurement
			// More than 100 bytes per second datarate is required to trigger the measurements
			{

				sl_u8 magicByteSeq[16];

				memset(magicByteSeq, SL_LIDAR_AUTOBAUD_MAGICBYTE, sizeof(magicByteSeq));

				sl_u64 startTS = getms();

				while (getms() - startTS < 1500) // lasting for 1.5sec
				{
					if (_channel->write(magicByteSeq, sizeof(magicByteSeq)) < 0)
					{
						return SL_RESULT_OPERATION_FAIL;
					}

					size_t dataCountGot;
					if (_channel->waitForData(1, 1, &dataCountGot))
					{
						// got reply, stop
						break;
					}
				}
			}

			// getback the bps measured
			_u32 bpsDetected = 0;
			size_t dataCountGot;
			if (_channel->waitForData(4, 500, &dataCountGot))
			{
				// got reply, stop
				_channel->read(&bpsDetected, 4);
				if (baudRateDetected)
					*baudRateDetected = bpsDetected;

				// send a confirmation to the LIDAR, otherwise, the previous baudrate will be reverted back
				sl_lidar_payload_new_bps_confirmation_t confirmation;
				confirmation.flag = 0x5F5F;
				confirmation.required_bps = requiredBaudRate;
				confirmation.param = 0;
				if (SL_IS_FAIL(_sendCommand(RPLIDAR_CMD_NEW_BAUDRATE_CONFIRM, &confirmation, sizeof(confirmation))))
					return RESULT_OPERATION_FAIL;

				return RESULT_OK;
			}

			return RESULT_OPERATION_TIMEOUT;
		}

	private:
		sl_result _sendCommand(sl_u16 cmd, const void *payload = NULL, size_t payloadsize = 0)
		{
			// sl_u8 pkt_header[10];
			sl_u8 checksum = 0;

			std::vector<sl_u8> cmd_packet;
			cmd_packet.clear();

			if (payloadsize && payload)
			{
				cmd |= SL_LIDAR_CMDFLAG_HAS_PAYLOAD;
			}
			_channel->flush();
			cmd_packet.push_back(SL_LIDAR_CMD_SYNC_BYTE);
			cmd_packet.push_back(cmd);

			if (cmd & SL_LIDAR_CMDFLAG_HAS_PAYLOAD)
			{
				std::vector<sl_u8> payloadMsg;
				checksum ^= SL_LIDAR_CMD_SYNC_BYTE;
				checksum ^= cmd;
				checksum ^= (payloadsize & 0xFF);

				// send size
				sl_u8 sizebyte = payloadsize;
				cmd_packet.push_back(sizebyte);
				// calc checksum
				for (size_t pos = 0; pos < payloadsize; ++pos)
				{
					checksum ^= ((sl_u8 *)payload)[pos];
					cmd_packet.push_back(((sl_u8 *)payload)[pos]);
				}
				cmd_packet.push_back(checksum);
			}
			sl_u8 packet[1024];
			for (int pos = 0; pos < cmd_packet.size(); pos++)
			{
				packet[pos] = cmd_packet[pos];
			}
			_channel->write(packet, cmd_packet.size());
			delay(1);
			return SL_RESULT_OK;
		}

		sl_result _waitResponseHeader(sl_lidar_ans_header_t *header, sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			int recvPos = 0;
			sl_u32 startTs = getms();
			sl_u8 recvBuffer[sizeof(sl_lidar_ans_header_t)];
			sl_u8 *headerBuffer = reinterpret_cast<sl_u8 *>(header);
			sl_u32 waitTime;

			while ((waitTime = getms() - startTs) <= timeout)
			{
				size_t remainSize = sizeof(sl_lidar_ans_header_t) - recvPos;
				size_t recvSize;

				bool ans = _channel->waitForData(remainSize, timeout - waitTime, &recvSize);
				if (!ans)
					return SL_RESULT_OPERATION_TIMEOUT;

				if (recvSize > remainSize)
					recvSize = remainSize;

