epfl-cs358/2025sp-turboslam/esp32/microros_rplidar_c1/src/sl_lidar_driver.cpp
				recvSize = _channel->read(recvBuffer, recvSize);

				for (size_t pos = 0; pos < recvSize; ++pos)
				{
					sl_u8 currentByte = recvBuffer[pos];
					switch (recvPos)
					{
					case 0:
						if (currentByte != SL_LIDAR_ANS_SYNC_BYTE1)
						{
							continue;
						}

						break;
					case 1:
						if (currentByte != SL_LIDAR_ANS_SYNC_BYTE2)
						{
							recvPos = 0;
							continue;
						}
						break;
					}
					headerBuffer[recvPos++] = currentByte;

					if (recvPos == sizeof(sl_lidar_ans_header_t))
					{
						return SL_RESULT_OK;
					}
				}
			}

			return SL_RESULT_OPERATION_TIMEOUT;
		}

		template <typename T>
		sl_result _waitResponse(T &payload, sl_u8 ansType, sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			sl_lidar_ans_header_t response_header;
			Result<nullptr_t> ans = SL_RESULT_OK;
			// delay(100);
			ans = _waitResponseHeader(&response_header, timeout);
			if (!ans)
				return ans;
			// verify whether we got a correct header
			if (response_header.type != ansType)
			{
				return SL_RESULT_INVALID_DATA;
			}
			// delay(50);
			sl_u32 header_size = (response_header.size_q30_subtype & SL_LIDAR_ANS_HEADER_SIZE_MASK);
			if (header_size < sizeof(T))
			{
				return SL_RESULT_INVALID_DATA;
			}
			if (!_channel->waitForData(header_size, timeout))
			{
				return SL_RESULT_OPERATION_TIMEOUT;
			}
			_channel->read(reinterpret_cast<sl_u8 *>(&payload), sizeof(T));
			return SL_RESULT_OK;
		}

		void _disableDataGrabbing()
		{
			//_clearRxDataCache();
			_isScanning = false;
			_cachethread.join();
		}

#define MAX_SCAN_NODES (8192)
		sl_result _waitNode(sl_lidar_response_measurement_node_t *node, sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			int recvPos = 0;
			sl_u32 startTs = getms();
			sl_u8 recvBuffer[sizeof(sl_lidar_response_measurement_node_t)];
			sl_u8 *nodeBuffer = (sl_u8 *)node;
			sl_u32 waitTime;

			while ((waitTime = getms() - startTs) <= timeout)
			{
				size_t remainSize = sizeof(sl_lidar_response_measurement_node_t) - recvPos;
				size_t recvSize;

				bool ans = _channel->waitForData(remainSize, timeout - waitTime, &recvSize);
				if (!ans)
					return SL_RESULT_OPERATION_FAIL;

				if (recvSize > remainSize)
					recvSize = remainSize;

				recvSize = _channel->read(recvBuffer, recvSize);

				for (size_t pos = 0; pos < recvSize; ++pos)
				{
					sl_u8 currentByte = recvBuffer[pos];
					switch (recvPos)
					{
					case 0: // expect the sync bit and its reverse in this byte
					{
						sl_u8 tmp = (currentByte >> 1);
						if ((tmp ^ currentByte) & 0x1)
						{
							// pass
						}
						else
						{
							continue;
						}
					}
					break;
					case 1: // expect the highest bit to be 1
					{
						if (currentByte & SL_LIDAR_RESP_MEASUREMENT_CHECKBIT)
						{
							// pass
						}
						else
						{
							recvPos = 0;
							continue;
						}
					}
					break;
					}
					nodeBuffer[recvPos++] = currentByte;

					if (recvPos == sizeof(sl_lidar_response_measurement_node_t))
					{
						return SL_RESULT_OK;
					}
				}
			}

			return SL_RESULT_OPERATION_TIMEOUT;
		}

		sl_result _waitScanData(sl_lidar_response_measurement_node_t *nodebuffer, size_t &count, sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			if (!_isConnected)
			{
				count = 0;
				return SL_RESULT_OPERATION_FAIL;
			}

			size_t recvNodeCount = 0;
			sl_u32 startTs = getms();
			sl_u32 waitTime;
			Result<nullptr_t> ans = SL_RESULT_OK;

			while ((waitTime = getms() - startTs) <= timeout && recvNodeCount < count)
			{
				sl_lidar_response_measurement_node_t node;
				ans = _waitNode(&node, timeout - waitTime);
				if (!ans)
					return ans;

				nodebuffer[recvNodeCount++] = node;

				if (recvNodeCount == count)
					return SL_RESULT_OK;
			}
			count = recvNodeCount;
			return SL_RESULT_OPERATION_TIMEOUT;
		}

		sl_result _cacheScanData()
		{

			sl_lidar_response_measurement_node_t local_buf[256];
			size_t count = 256;

#ifdef ESP32
			size_t localScanSize = MAX_SCAN_NODES * sizeof(sl_lidar_response_measurement_node_hq_t);
			sl_lidar_response_measurement_node_hq_t *local_scan = static_cast<sl_lidar_response_measurement_node_hq_t *>(ps_malloc(localScanSize));
			assert(local_scan != nullptr);
#else
			sl_lidar_response_measurement_node_hq_t local_scan[MAX_SCAN_NODES];
#endif

			size_t scan_count = 0;
			Result<nullptr_t> ans = SL_RESULT_OK;

#ifdef ESP32
			memset(local_scan, 0, localScanSize);
#else
			memset(local_scan, 0, sizeof(local_scan));
#endif

			_waitScanData(local_buf, count); // // always discard the first data since it may be incomplete

			while (_isScanning)
			{
				ans = _waitScanData(local_buf, count);

				if (!ans)
				{
					if ((sl_result)ans != SL_RESULT_OPERATION_TIMEOUT)
					{
						_isScanning = false;
						return SL_RESULT_OPERATION_FAIL;
					}
				}

				for (size_t pos = 0; pos < count; ++pos)
				{
					if (local_buf[pos].sync_quality & SL_LIDAR_RESP_MEASUREMENT_SYNCBIT)
					{
						// only publish the data when it contains a full 360 degree scan

						if ((local_scan[0].flag & SL_LIDAR_RESP_MEASUREMENT_SYNCBIT))
						{
							_lock.lock();
							memcpy(_cached_scan_node_hq_buf, local_scan, scan_count * sizeof(sl_lidar_response_measurement_node_hq_t));
							_cached_scan_node_hq_count = scan_count;
							_dataEvt.set();
							_lock.unlock();
						}
						scan_count = 0;
					}

					sl_lidar_response_measurement_node_hq_t nodeHq;
					convert(local_buf[pos], nodeHq);
					local_scan[scan_count++] = nodeHq;

#ifdef ESP32
					if (scan_count == MAX_SCAN_NODES)
						scan_count -= 1; // prevent overflow
#else
					if (scan_count == _countof(local_scan))
						scan_count -= 1; // prevent overflow
#endif

					// for interval retrieve
					{
						rp::hal::AutoLocker l(_lock);
						_cached_scan_node_hq_buf_for_interval_retrieve[_cached_scan_node_hq_count_for_interval_retrieve++] = nodeHq;
						if (_cached_scan_node_hq_count_for_interval_retrieve == _countof(_cached_scan_node_hq_buf_for_interval_retrieve))
							_cached_scan_node_hq_count_for_interval_retrieve -= 1; // prevent overflow
					}
				}
			}

#ifdef ESP32
			free(local_scan);
#endif
			_isScanning = false;
			return SL_RESULT_OK;
		}

