epfl-cs358/2025sp-turboslam/esp32/microros_rplidar_c1/src/sl_lidar_driver.cpp
		void _ultraCapsuleToNormal(const sl_lidar_response_ultra_capsule_measurement_nodes_t &capsule, sl_lidar_response_measurement_node_hq_t *nodebuffer, size_t &nodeCount)
		{
			nodeCount = 0;
			if (_is_previous_capsuledataRdy)
			{
				int diffAngle_q8;
				int currentStartAngle_q8 = ((capsule.start_angle_sync_q6 & 0x7FFF) << 2);
				int prevStartAngle_q8 = ((_cached_previous_ultracapsuledata.start_angle_sync_q6 & 0x7FFF) << 2);

				diffAngle_q8 = (currentStartAngle_q8) - (prevStartAngle_q8);
				if (prevStartAngle_q8 > currentStartAngle_q8)
				{
					diffAngle_q8 += (360 << 8);
				}

				int angleInc_q16 = (diffAngle_q8 << 3) / 3;
				int currentAngle_raw_q16 = (prevStartAngle_q8 << 8);
				for (size_t pos = 0; pos < _countof(_cached_previous_ultracapsuledata.ultra_cabins); ++pos)
				{
					int dist_q2[3];
					int angle_q6[3];
					int syncBit[3];

					sl_u32 combined_x3 = _cached_previous_ultracapsuledata.ultra_cabins[pos].combined_x3;

					// unpack ...
					int dist_major = (combined_x3 & 0xFFF);

					// signed partical integer, using the magic shift here
					// DO NOT TOUCH

					int dist_predict1 = (((int)(combined_x3 << 10)) >> 22);
					int dist_predict2 = (((int)combined_x3) >> 22);

					int dist_major2;

					sl_u32 scalelvl1, scalelvl2;

					// prefetch next ...
					if (pos == _countof(_cached_previous_ultracapsuledata.ultra_cabins) - 1)
					{
						dist_major2 = (capsule.ultra_cabins[0].combined_x3 & 0xFFF);
					}
					else
					{
						dist_major2 = (_cached_previous_ultracapsuledata.ultra_cabins[pos + 1].combined_x3 & 0xFFF);
					}

					// decode with the var bit scale ...
					dist_major = _varbitscale_decode(dist_major, scalelvl1);
					dist_major2 = _varbitscale_decode(dist_major2, scalelvl2);

					int dist_base1 = dist_major;
					int dist_base2 = dist_major2;

					if ((!dist_major) && dist_major2)
					{
						dist_base1 = dist_major2;
						scalelvl1 = scalelvl2;
					}

					dist_q2[0] = (dist_major << 2);
					if ((dist_predict1 == 0xFFFFFE00) || (dist_predict1 == 0x1FF))
					{
						dist_q2[1] = 0;
					}
					else
					{
						dist_predict1 = (dist_predict1 << scalelvl1);
						dist_q2[1] = (dist_predict1 + dist_base1) << 2;
					}

					if ((dist_predict2 == 0xFFFFFE00) || (dist_predict2 == 0x1FF))
					{
						dist_q2[2] = 0;
					}
					else
					{
						dist_predict2 = (dist_predict2 << scalelvl2);
						dist_q2[2] = (dist_predict2 + dist_base2) << 2;
					}

					for (int cpos = 0; cpos < 3; ++cpos)
					{
						syncBit[cpos] = (((currentAngle_raw_q16 + angleInc_q16) % (360 << 16)) < angleInc_q16) ? 1 : 0;

						int offsetAngleMean_q16 = (int)(7.5 * 3.1415926535 * (1 << 16) / 180.0);

						if (dist_q2[cpos] >= (50 * 4))
						{
							const int k1 = 98361;
							const int k2 = int(k1 / dist_q2[cpos]);

							offsetAngleMean_q16 = (int)(8 * 3.1415926535 * (1 << 16) / 180) - (k2 << 6) - (k2 * k2 * k2) / 98304;
						}

						angle_q6[cpos] = ((currentAngle_raw_q16 - int(offsetAngleMean_q16 * 180 / 3.14159265)) >> 10);
						currentAngle_raw_q16 += angleInc_q16;

						if (angle_q6[cpos] < 0)
							angle_q6[cpos] += (360 << 6);
						if (angle_q6[cpos] >= (360 << 6))
							angle_q6[cpos] -= (360 << 6);

						sl_lidar_response_measurement_node_hq_t node;

						node.flag = (syncBit[cpos] | ((!syncBit[cpos]) << 1));
						node.quality = dist_q2[cpos] ? (0x2F << SL_LIDAR_RESP_MEASUREMENT_QUALITY_SHIFT) : 0;
						node.angle_z_q14 = sl_u16((angle_q6[cpos] << 8) / 90);
						node.dist_mm_q2 = dist_q2[cpos];

						nodebuffer[nodeCount++] = node;
					}
				}
			}

			_cached_previous_ultracapsuledata = capsule;
			_is_previous_capsuledataRdy = true;
		}

		sl_result _waitCapsuledNode(sl_lidar_response_capsule_measurement_nodes_t &node, sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			int recvPos = 0;
			sl_u32 startTs = getms();
			sl_u8 recvBuffer[sizeof(sl_lidar_response_capsule_measurement_nodes_t)];
			sl_u8 *nodeBuffer = (sl_u8 *)&node;
			sl_u32 waitTime;
			while ((waitTime = getms() - startTs) <= timeout)
			{
				size_t remainSize = sizeof(sl_lidar_response_capsule_measurement_nodes_t) - recvPos;
				size_t recvSize;
				bool ans = _channel->waitForData(remainSize, timeout - waitTime, &recvSize);
				if (!ans)
					return SL_RESULT_OPERATION_TIMEOUT;

				if (recvSize > remainSize)
					recvSize = remainSize;
				recvSize = _channel->read(recvBuffer, recvSize);

				for (size_t pos = 0; pos < recvSize; ++pos)
				{
					sl_u8 currentByte = recvBuffer[pos];

					switch (recvPos)
					{
					case 0: // expect the sync bit 1
					{
						sl_u8 tmp = (currentByte >> 4);
						if (tmp == SL_LIDAR_RESP_MEASUREMENT_EXP_SYNC_1)
						{
							// pass
						}
						else
						{
							_is_previous_capsuledataRdy = false;
							continue;
						}
					}
					break;
					case 1: // expect the sync bit 2
					{
						sl_u8 tmp = (currentByte >> 4);
						if (tmp == SL_LIDAR_RESP_MEASUREMENT_EXP_SYNC_2)
						{
							// pass
						}
						else
						{
							recvPos = 0;
							_is_previous_capsuledataRdy = false;
							continue;
						}
					}
					break;
					}
					nodeBuffer[recvPos++] = currentByte;
					if (recvPos == sizeof(sl_lidar_response_capsule_measurement_nodes_t))
					{
						// calc the checksum ...
						sl_u8 checksum = 0;
						sl_u8 recvChecksum = ((node.s_checksum_1 & 0xF) | (node.s_checksum_2 << 4));
						for (size_t cpos = offsetof(sl_lidar_response_capsule_measurement_nodes_t, start_angle_sync_q6);
								 cpos < sizeof(sl_lidar_response_capsule_measurement_nodes_t); ++cpos)
						{
							checksum ^= nodeBuffer[cpos];
						}
						if (recvChecksum == checksum)
						{
							// only consider vaild if the checksum matches...
							if (node.start_angle_sync_q6 & SL_LIDAR_RESP_MEASUREMENT_EXP_SYNCBIT)
							{
								// this is the first capsule frame in logic, discard the previous cached data...
								_scan_node_synced = false;
								_is_previous_capsuledataRdy = false;
								return SL_RESULT_OK;
							}
							return SL_RESULT_OK;
						}
						_is_previous_capsuledataRdy = false;
						return SL_RESULT_INVALID_DATA;
					}
				}
			}
			_is_previous_capsuledataRdy = false;
			return SL_RESULT_OPERATION_TIMEOUT;
		}
		void _capsuleToNormal(const sl_lidar_response_capsule_measurement_nodes_t &capsule, sl_lidar_response_measurement_node_hq_t *nodebuffer, size_t &nodeCount)
		{
			nodeCount = 0;
			if (_is_previous_capsuledataRdy)
			{
				int diffAngle_q8;
				int currentStartAngle_q8 = ((capsule.start_angle_sync_q6 & 0x7FFF) << 2);
				int prevStartAngle_q8 = ((_cached_previous_capsuledata.start_angle_sync_q6 & 0x7FFF) << 2);

				diffAngle_q8 = (currentStartAngle_q8) - (prevStartAngle_q8);
				if (prevStartAngle_q8 > currentStartAngle_q8)
				{
					diffAngle_q8 += (360 << 8);
				}

				int angleInc_q16 = (diffAngle_q8 << 3);
				int currentAngle_raw_q16 = (prevStartAngle_q8 << 8);
				for (size_t pos = 0; pos < _countof(_cached_previous_capsuledata.cabins); ++pos)
				{
					int dist_q2[2];
					int angle_q6[2];
					int syncBit[2];

					dist_q2[0] = (_cached_previous_capsuledata.cabins[pos].distance_angle_1 & 0xFFFC);
					dist_q2[1] = (_cached_previous_capsuledata.cabins[pos].distance_angle_2 & 0xFFFC);

					int angle_offset1_q3 =
							((_cached_previous_capsuledata.cabins[pos].offset_angles_q3 & 0xF) | ((_cached_previous_capsuledata.cabins[pos].distance_angle_1 & 0x3) << 4));
					int angle_offset2_q3 = ((_cached_previous_capsuledata.cabins[pos].offset_angles_q3 >> 4) | ((_cached_previous_capsuledata.cabins[pos].distance_angle_2 & 0x3) << 4));

					angle_q6[0] = ((currentAngle_raw_q16 - (angle_offset1_q3 << 13)) >> 10);
					syncBit[0] = (((currentAngle_raw_q16 + angleInc_q16) % (360 << 16)) < angleInc_q16) ? 1 : 0;
					currentAngle_raw_q16 += angleInc_q16;

