epfl-cs358/2025sp-turboslam/esp32/microros_rplidar_c1/src/sl_lidar_driver.cpp
					angle_q6[1] = ((currentAngle_raw_q16 - (angle_offset2_q3 << 13)) >> 10);
					syncBit[1] = (((currentAngle_raw_q16 + angleInc_q16) % (360 << 16)) < angleInc_q16) ? 1 : 0;
					currentAngle_raw_q16 += angleInc_q16;

					for (int cpos = 0; cpos < 2; ++cpos)
					{

						if (angle_q6[cpos] < 0)
							angle_q6[cpos] += (360 << 6);
						if (angle_q6[cpos] >= (360 << 6))
							angle_q6[cpos] -= (360 << 6);

						sl_lidar_response_measurement_node_hq_t node;

						node.angle_z_q14 = sl_u16((angle_q6[cpos] << 8) / 90);
						node.flag = (syncBit[cpos] | ((!syncBit[cpos]) << 1));
						node.quality = dist_q2[cpos] ? (0x2f << SL_LIDAR_RESP_MEASUREMENT_QUALITY_SHIFT) : 0;
						node.dist_mm_q2 = dist_q2[cpos];

						nodebuffer[nodeCount++] = node;
					}
				}
			}

			_cached_previous_capsuledata = capsule;
			_is_previous_capsuledataRdy = true;
		}

		void _dense_capsuleToNormal(const sl_lidar_response_capsule_measurement_nodes_t &capsule, sl_lidar_response_measurement_node_hq_t *nodebuffer, size_t &nodeCount)
		{
			static int lastNodeSyncBit = 0;
			const sl_lidar_response_dense_capsule_measurement_nodes_t *dense_capsule = reinterpret_cast<const sl_lidar_response_dense_capsule_measurement_nodes_t *>(&capsule);
			nodeCount = 0;
			if (_is_previous_capsuledataRdy)
			{
				int diffAngle_q8;
				int currentStartAngle_q8 = ((dense_capsule->start_angle_sync_q6 & 0x7FFF) << 2);
				int prevStartAngle_q8 = ((_cached_previous_dense_capsuledata.start_angle_sync_q6 & 0x7FFF) << 2);

				diffAngle_q8 = (currentStartAngle_q8) - (prevStartAngle_q8);
				if (prevStartAngle_q8 > currentStartAngle_q8)
				{
					diffAngle_q8 += (360 << 8);
				}

				int angleInc_q16 = (diffAngle_q8 << 8) / 40;
				int currentAngle_raw_q16 = (prevStartAngle_q8 << 8);
				for (size_t pos = 0; pos < _countof(_cached_previous_dense_capsuledata.cabins); ++pos)
				{
					int dist_q2;
					int angle_q6;
					int syncBit;
					// const int dist = static_cast<const int>(_cached_previous_dense_capsuledata.cabins[pos].distance);
					const int dist = _cached_previous_dense_capsuledata.cabins[pos].distance;
					dist_q2 = dist << 2;
					angle_q6 = (currentAngle_raw_q16 >> 10);

					syncBit = (((currentAngle_raw_q16 + angleInc_q16) % (360 << 16)) < (angleInc_q16 << 1)) ? 1 : 0;
					syncBit = (syncBit ^ lastNodeSyncBit) & syncBit; // Ensure that syncBit is exactly detected
					if (syncBit)
					{
						_scan_node_synced = true;
					}

					currentAngle_raw_q16 += angleInc_q16;

					if (angle_q6 < 0)
						angle_q6 += (360 << 6);
					if (angle_q6 >= (360 << 6))
						angle_q6 -= (360 << 6);

					sl_lidar_response_measurement_node_hq_t node;

					node.angle_z_q14 = sl_u16((angle_q6 << 8) / 90);
					node.flag = (syncBit | ((!syncBit) << 1));
					node.quality = dist_q2 ? (0x2f << SL_LIDAR_RESP_MEASUREMENT_QUALITY_SHIFT) : 0;
					node.dist_mm_q2 = dist_q2;
					if (_scan_node_synced)
						nodebuffer[nodeCount++] = node;
					lastNodeSyncBit = syncBit;
				}
			}
			else
			{
				_scan_node_synced = false;
			}

			_cached_previous_dense_capsuledata = *dense_capsule;
			_is_previous_capsuledataRdy = true;
		}

		sl_result _cacheCapsuledScanData()
		{
			sl_lidar_response_capsule_measurement_nodes_t capsule_node;
			sl_lidar_response_measurement_node_hq_t local_buf[256];
			size_t count = 256;

#ifdef ESP32
			size_t localScanSize = MAX_SCAN_NODES * sizeof(sl_lidar_response_measurement_node_hq_t);
			sl_lidar_response_measurement_node_hq_t *local_scan = static_cast<sl_lidar_response_measurement_node_hq_t *>(ps_malloc(localScanSize));
			assert(local_scan != nullptr);
#else
			sl_lidar_response_measurement_node_hq_t local_scan[MAX_SCAN_NODES];
#endif

			size_t scan_count = 0;
			Result<nullptr_t> ans = SL_RESULT_OK;

#ifdef ESP32
			memset(local_scan, 0, localScanSize);
#else
			memset(local_scan, 0, sizeof(local_scan));
#endif

			_waitCapsuledNode(capsule_node); // // always discard the first data since it may be incomplete

			while (_isScanning)
			{
				ans = _waitCapsuledNode(capsule_node);
				if (!ans)
				{
					if ((sl_result)ans != SL_RESULT_OPERATION_TIMEOUT && (sl_result)ans != SL_RESULT_INVALID_DATA)
					{
						_isScanning = false;
						return SL_RESULT_OPERATION_FAIL;
					}
					else
					{
						// current data is invalid, do not use it.
						continue;
					}
				}
				switch (_cached_capsule_flag)
				{
				case NORMAL_CAPSULE:
					_capsuleToNormal(capsule_node, local_buf, count);
					break;
				case DENSE_CAPSULE:
					_dense_capsuleToNormal(capsule_node, local_buf, count);
					break;
				}
				//

				for (size_t pos = 0; pos < count; ++pos)
				{
					if (local_buf[pos].flag & SL_LIDAR_RESP_MEASUREMENT_SYNCBIT)
					{
						// only publish the data when it contains a full 360 degree scan

						if ((local_scan[0].flag & SL_LIDAR_RESP_MEASUREMENT_SYNCBIT))
						{
							_lock.lock();
							memcpy(_cached_scan_node_hq_buf, local_scan, scan_count * sizeof(sl_lidar_response_measurement_node_hq_t));
							_cached_scan_node_hq_count = scan_count;
							_dataEvt.set();
							_lock.unlock();
						}
						scan_count = 0;
					}
					local_scan[scan_count++] = local_buf[pos];

#ifdef ESP32
					if (scan_count == MAX_SCAN_NODES)
						scan_count -= 1; // prevent overflow
#else
					if (scan_count == _countof(local_scan))
						scan_count -= 1; // prevent overflow
#endif

					// for interval retrieve
					{
						rp::hal::AutoLocker l(_lock);
						_cached_scan_node_hq_buf_for_interval_retrieve[_cached_scan_node_hq_count_for_interval_retrieve++] = local_buf[pos];
						if (_cached_scan_node_hq_count_for_interval_retrieve == _countof(_cached_scan_node_hq_buf_for_interval_retrieve))
							_cached_scan_node_hq_count_for_interval_retrieve -= 1; // prevent overflow
					}
				}
			}

#ifdef ESP32
			free(local_scan);
#endif
			_isScanning = false;

			return SL_RESULT_OK;
		}

		sl_result _waitHqNode(sl_lidar_response_hq_capsule_measurement_nodes_t &node, sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			if (!_isConnected)
			{
				return SL_RESULT_OPERATION_FAIL;
			}

			int recvPos = 0;
			sl_u32 startTs = getms();
			sl_u8 recvBuffer[sizeof(sl_lidar_response_hq_capsule_measurement_nodes_t)];
			sl_u8 *nodeBuffer = (sl_u8 *)&node;
			sl_u32 waitTime;

			while ((waitTime = getms() - startTs) <= timeout)
			{
				size_t remainSize = sizeof(sl_lidar_response_hq_capsule_measurement_nodes_t) - recvPos;
				size_t recvSize;

				bool ans = _channel->waitForData(remainSize, timeout - waitTime, &recvSize);
				if (!ans)
				{
					return SL_RESULT_OPERATION_TIMEOUT;
				}
				if (recvSize > remainSize)
					recvSize = remainSize;

