epfl-cs358/2025sp-turboslam/esp32/microros_rplidar_c1/src/sl_lidar_driver.cpp
				recvSize = _channel->read(recvBuffer, recvSize);

				for (size_t pos = 0; pos < recvSize; ++pos)
				{
					sl_u8 currentByte = recvBuffer[pos];
					switch (recvPos)
					{
					case 0: // expect the sync byte
					{
						sl_u8 tmp = (currentByte);
						if (tmp == SL_LIDAR_RESP_MEASUREMENT_HQ_SYNC)
						{
							// pass
						}
						else
						{
							recvPos = 0;
							_is_previous_HqdataRdy = false;
							continue;
						}
					}
					break;
					case sizeof(sl_lidar_response_hq_capsule_measurement_nodes_t) - 1 - 4:
					{
					}
					break;
					case sizeof(sl_lidar_response_hq_capsule_measurement_nodes_t) - 1:
					{
					}
					break;
					}
					nodeBuffer[recvPos++] = currentByte;
					if (recvPos == sizeof(sl_lidar_response_hq_capsule_measurement_nodes_t))
					{
						sl_u32 crcCalc2 = crc32::getResult(nodeBuffer, sizeof(sl_lidar_response_hq_capsule_measurement_nodes_t) - 4);

						if (crcCalc2 == node.crc32)
						{
							_is_previous_HqdataRdy = true;
							return SL_RESULT_OK;
						}
						else
						{
							_is_previous_HqdataRdy = false;
							return SL_RESULT_INVALID_DATA;
						}
					}
				}
			}
			_is_previous_HqdataRdy = false;
			return SL_RESULT_OPERATION_TIMEOUT;
		}

		void _HqToNormal(const sl_lidar_response_hq_capsule_measurement_nodes_t &node_hq, sl_lidar_response_measurement_node_hq_t *nodebuffer, size_t &nodeCount)
		{
			nodeCount = 0;
			if (_is_previous_HqdataRdy)
			{
				for (size_t pos = 0; pos < _countof(_cached_previous_Hqdata.node_hq); ++pos)
				{
					nodebuffer[nodeCount++] = node_hq.node_hq[pos];
				}
			}
			_cached_previous_Hqdata = node_hq;
			_is_previous_HqdataRdy = true;
		}

		sl_result _cacheHqScanData()
		{
			sl_lidar_response_hq_capsule_measurement_nodes_t hq_node;
			sl_lidar_response_measurement_node_hq_t local_buf[256];
			size_t count = 256;

#ifdef ESP32
			size_t localScanSize = MAX_SCAN_NODES * sizeof(sl_lidar_response_measurement_node_hq_t);
			sl_lidar_response_measurement_node_hq_t *local_scan = static_cast<sl_lidar_response_measurement_node_hq_t *>(ps_malloc(localScanSize));
			assert(local_scan != nullptr);
#else
			sl_lidar_response_measurement_node_hq_t local_scan[MAX_SCAN_NODES];
#endif

			size_t scan_count = 0;
			Result<nullptr_t> ans = SL_RESULT_OK;

#ifdef ESP32
			memset(local_scan, 0, localScanSize);
#else
			memset(local_scan, 0, sizeof(local_scan));
#endif

			_waitHqNode(hq_node);
			while (_isScanning)
			{
				ans = _waitHqNode(hq_node);
				if (!ans)
				{
					if ((sl_result)ans != SL_RESULT_OPERATION_TIMEOUT && (sl_result)ans != SL_RESULT_INVALID_DATA)
					{
						_isScanning = false;
						return SL_RESULT_OPERATION_FAIL;
					}
					else
					{
						// current data is invalid, do not use it.
						continue;
					}
				}

				_HqToNormal(hq_node, local_buf, count);
				for (size_t pos = 0; pos < count; ++pos)
				{
					if (local_buf[pos].flag & SL_LIDAR_RESP_MEASUREMENT_SYNCBIT)
					{
						// only publish the data when it contains a full 360 degree scan
						if ((local_scan[0].flag & SL_LIDAR_RESP_MEASUREMENT_SYNCBIT))
						{
							_lock.lock();
							memcpy(_cached_scan_node_hq_buf, local_scan, scan_count * sizeof(sl_lidar_response_measurement_node_hq_t));
							_cached_scan_node_hq_count = scan_count;
							_dataEvt.set();
							_lock.unlock();
						}
						scan_count = 0;
					}
					local_scan[scan_count++] = local_buf[pos];

#ifdef ESP32
					if (scan_count == MAX_SCAN_NODES)
						scan_count -= 1; // prevent overflow
#else
					if (scan_count == _countof(local_scan))
						scan_count -= 1; // prevent overflow
#endif

					// for interval retrieve
					{
						rp::hal::AutoLocker l(_lock);
						_cached_scan_node_hq_buf_for_interval_retrieve[_cached_scan_node_hq_count_for_interval_retrieve++] = local_buf[pos];
						if (_cached_scan_node_hq_count_for_interval_retrieve == _countof(_cached_scan_node_hq_buf_for_interval_retrieve))
							_cached_scan_node_hq_count_for_interval_retrieve -= 1; // prevent overflow
					}
				}
			}

#ifdef ESP32
			free(local_scan);
#endif
			_isScanning = false;
			return SL_RESULT_OK;
		}

		sl_result _waitUltraCapsuledNode(sl_lidar_response_ultra_capsule_measurement_nodes_t &node, sl_u32 timeout = DEFAULT_TIMEOUT)
		{
			if (!_isConnected)
			{
				return SL_RESULT_OPERATION_FAIL;
			}

			int recvPos = 0;
			sl_u32 startTs = getms();
			sl_u8 recvBuffer[sizeof(sl_lidar_response_ultra_capsule_measurement_nodes_t)];
			sl_u8 *nodeBuffer = (sl_u8 *)&node;
			sl_u32 waitTime;

			while ((waitTime = getms() - startTs) <= timeout)
			{
				size_t remainSize = sizeof(sl_lidar_response_ultra_capsule_measurement_nodes_t) - recvPos;
				size_t recvSize;

				bool ans = _channel->waitForData(remainSize, timeout - waitTime, &recvSize);
				if (!ans)
				{
					return SL_RESULT_OPERATION_TIMEOUT;
				}
				if (recvSize > remainSize)
					recvSize = remainSize;

				recvSize = _channel->read(recvBuffer, recvSize);

				for (size_t pos = 0; pos < recvSize; ++pos)
				{
					sl_u8 currentByte = recvBuffer[pos];
					switch (recvPos)
					{
					case 0: // expect the sync bit 1
					{
						sl_u8 tmp = (currentByte >> 4);
						if (tmp == SL_LIDAR_RESP_MEASUREMENT_EXP_SYNC_1)
						{
							// pass
						}
						else
						{
							_is_previous_capsuledataRdy = false;
							continue;
						}
					}
					break;
					case 1: // expect the sync bit 2
					{
						sl_u8 tmp = (currentByte >> 4);
						if (tmp == SL_LIDAR_RESP_MEASUREMENT_EXP_SYNC_2)
						{
							// pass
						}
						else
						{
							recvPos = 0;
							_is_previous_capsuledataRdy = false;
							continue;
						}
					}
					break;
					}
					nodeBuffer[recvPos++] = currentByte;
					if (recvPos == sizeof(sl_lidar_response_ultra_capsule_measurement_nodes_t))
					{
						// calc the checksum ...
						sl_u8 checksum = 0;
						sl_u8 recvChecksum = ((node.s_checksum_1 & 0xF) | (node.s_checksum_2 << 4));

						for (size_t cpos = offsetof(sl_lidar_response_ultra_capsule_measurement_nodes_t, start_angle_sync_q6);
								 cpos < sizeof(sl_lidar_response_ultra_capsule_measurement_nodes_t); ++cpos)
						{
							checksum ^= nodeBuffer[cpos];
						}

						if (recvChecksum == checksum)
						{
							// only consider vaild if the checksum matches...
							if (node.start_angle_sync_q6 & SL_LIDAR_RESP_MEASUREMENT_EXP_SYNCBIT)
							{
								// this is the first capsule frame in logic, discard the previous cached data...
								_is_previous_capsuledataRdy = false;
								return SL_RESULT_OK;
							}
							return SL_RESULT_OK;
						}
						_is_previous_capsuledataRdy = false;
						return SL_RESULT_INVALID_DATA;
					}
				}
			}
			_is_previous_capsuledataRdy = false;
			return SL_RESULT_OPERATION_TIMEOUT;
		}

		sl_result _cacheUltraCapsuledScanData()
		{
			sl_lidar_response_ultra_capsule_measurement_nodes_t ultra_capsule_node;
			sl_lidar_response_measurement_node_hq_t local_buf[256];
			size_t count = 256;

#ifdef ESP32
			size_t localScanSize = MAX_SCAN_NODES * sizeof(sl_lidar_response_measurement_node_hq_t);
			sl_lidar_response_measurement_node_hq_t *local_scan = static_cast<sl_lidar_response_measurement_node_hq_t *>(ps_malloc(localScanSize));
			assert(local_scan != nullptr);
#else
			sl_lidar_response_measurement_node_hq_t local_scan[MAX_SCAN_NODES];
#endif

			size_t scan_count = 0;
			Result<nullptr_t> ans = SL_RESULT_OK;

#ifdef ESP32
			memset(local_scan, 0, localScanSize);
#else
			memset(local_scan, 0, sizeof(local_scan));
#endif

			_waitUltraCapsuledNode(ultra_capsule_node);

			while (_isScanning)
			{
				ans = _waitUltraCapsuledNode(ultra_capsule_node);
				if (!ans)
				{
					if ((sl_result)ans != SL_RESULT_OPERATION_TIMEOUT && (sl_result)ans != SL_RESULT_INVALID_DATA)
					{
						_isScanning = false;
						return SL_RESULT_OPERATION_FAIL;
					}
					else
					{
						// current data is invalid, do not use it.
						continue;
					}
				}

