epfl-cs358/2025sp-turboslam/esp32/microros_rplidar_c1/src/sl_lidar_driver.cpp
				_ultraCapsuleToNormal(ultra_capsule_node, local_buf, count);

				for (size_t pos = 0; pos < count; ++pos)
				{
					if (local_buf[pos].flag & SL_LIDAR_RESP_MEASUREMENT_SYNCBIT)
					{
						// only publish the data when it contains a full 360 degree scan

						if ((local_scan[0].flag & SL_LIDAR_RESP_MEASUREMENT_SYNCBIT))
						{
							_lock.lock();
							memcpy(_cached_scan_node_hq_buf, local_scan, scan_count * sizeof(sl_lidar_response_measurement_node_hq_t));
							_cached_scan_node_hq_count = scan_count;
							_dataEvt.set();
							_lock.unlock();
						}
						scan_count = 0;
					}
					local_scan[scan_count++] = local_buf[pos];

#ifdef ESP32
					if (scan_count == MAX_SCAN_NODES)
						scan_count -= 1; // prevent overflow
#else
					if (scan_count == _countof(local_scan))
						scan_count -= 1; // prevent overflow
#endif

					// for interval retrieve
					{
						rp::hal::AutoLocker l(_lock);
						_cached_scan_node_hq_buf_for_interval_retrieve[_cached_scan_node_hq_count_for_interval_retrieve++] = local_buf[pos];
						if (_cached_scan_node_hq_count_for_interval_retrieve == _countof(_cached_scan_node_hq_buf_for_interval_retrieve))
							_cached_scan_node_hq_count_for_interval_retrieve -= 1; // prevent overflow
					}
				}
			}

#ifdef ESP32
			free(local_scan);
#endif
			_isScanning = false;
			return SL_RESULT_OK;
		}

		sl_result _clearRxDataCache()
		{
			if (!isConnected())
				return SL_RESULT_OPERATION_FAIL;
			_channel->flush();
			return SL_RESULT_OK;
		}

	private:
		IChannel *_channel;
		bool _isConnected;
		bool _isScanning;
		MotorCtrlSupport _isSupportingMotorCtrl;
		rp::hal::Locker _lock;
		rp::hal::Event _dataEvt;
		rp::hal::Thread _cachethread;
		sl_u16 _cached_sampleduration_std;
		sl_u16 _cached_sampleduration_express;
		bool _scan_node_synced;

		sl_lidar_response_measurement_node_hq_t _cached_scan_node_hq_buf[8192];
		size_t _cached_scan_node_hq_count;
		sl_u8 _cached_capsule_flag;

		sl_lidar_response_measurement_node_hq_t _cached_scan_node_hq_buf_for_interval_retrieve[8192];
		size_t _cached_scan_node_hq_count_for_interval_retrieve;

		sl_lidar_response_capsule_measurement_nodes_t _cached_previous_capsuledata;
		sl_lidar_response_dense_capsule_measurement_nodes_t _cached_previous_dense_capsuledata;
		sl_lidar_response_ultra_capsule_measurement_nodes_t _cached_previous_ultracapsuledata;
		sl_lidar_response_hq_capsule_measurement_nodes_t _cached_previous_Hqdata;
		bool _is_previous_capsuledataRdy;
		bool _is_previous_HqdataRdy;
	};

	Result<ILidarDriver *> createLidarDriver()
	{
		return new SlamtecLidarDriver();
	}

	// Result<ILidarDriver *> createLidarDriver()
	// {
	// 	// allocate raw memory to avoid throwing exceptions
	// 	void *buf = malloc(sizeof(SlamtecLidarDriver));
	// 	if (!buf)
	// 	{
	// 		Serial.println("SL SDK: createLidarDriver() malloc failed");
	// 		// SL_RESULT_OPERATION_FAIL is a generic failure code—adjust if needed
	// 		// return {SL_RESULT_OPERATION_FAIL, nullptr};
	// 		return nullptr;
	// 	}

	// 	// placement-new into that buffer
	// 	auto drv = new (buf) SlamtecLidarDriver();
	// 	// return {SL_RESULT_OK, drv};
	// 	return drv;
	// }

	// Result<ILidarDriver *> createLidarDriver()
	// {
	// 	// Use a single static driver instance so we never run out of heap:
	// 	static SlamtecLidarDriver drv;
	// 	// (optional) you can print once to confirm:
	// 	static bool printed = false;
	// 	if (!printed)
	// 	{
	// 		Serial.println("SL SDK: using static SlamtecLidarDriver");
	// 		printed = true;
	// 	}
	// 	return &drv;
	// }
}
